<?php

use yii\db\Migration;

/**
 * Class m181124_151354_insert_news_table
 */
class m181124_151354_insert_news_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('news', ['title', 'img', 'description', 'text', 'category_id'], [
            ['Переговоры судей во время класико. Такого вы ещё не слышали', 'sport1.jpg',
                'Арбитр не хотел ставить пенальти на Суаресе. Но VAR всё изменил.', 'Последнее «класико» запомнилось не только разгромным счётом, но и тем, что впервые в истории противостояний «Барселоны» и «Реала» был использован VAR – видеоассистент рефери.

На 27-й минуте матча после прострела Жорди Альбы с левого фланга Луис Суарес побежал за мячом и был сбит Рафаэлем Вараном. Судья остановил игру не сразу — засомневался, было ли нарушение. Но после подсказки сотрудника видеопомощи арбитров рефери всё же решил игру не продолжать и пересмотреть момент. После этого был назначен пенальти. 

Судейский комитет Ла Лиги опубликовал переговоры судей и сотрудника VAR во время этого момента. Это действительно интересно. 

Итак, Суарес падает после контакта с Вараном.', 1],
            ['Нюландер шантажирует клуб НХЛ. Прямо как Яшин или Фёдоров', '1.jpg', 'Арбитр не хотел ставить пенальти на Суаресе. Но VAR всё изменил.',
                'Вильям Нюландер недавно вошёл в историю НХЛ как участник самой 
                длинной забастовки в эпоху потолка зарплат. 
                Скоро закончится второй месяц регулярного чемпионата, 
                а он по-прежнему отказывается подписывать контракт с «Торонто». 
                Если стороны не успеют договориться к 1 декабря, в этом чемпионате 
                НХЛ молодой нападающий уже не сыграет. Накануне появилась информация о
                 том, что Нюландер всё-таки подпишет соглашение, 
                 но подтверждений этому пока нет. Шведский форвард просит зарплату в 
                 $ 8 млн, в то время как клуб не готов предложить больше $ 7 млн. 
                 Пока Нюландер и боссы «Торонто» взвешивают все за и против, 
                 мы вспоминаем самые громкие забастовки в истории НХЛ.', 2]
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m181124_151354_insert_news_table cannot be reverted.\n";

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m181124_151354_insert_news_table cannot be reverted.\n";

        return false;
    }
    */
}
